sayyadumar/qemu/include/hw/rx/rx65n.h
/*
 * RX65N MCU Object
 *
 * Datasheet: RX65N Group, RX651 Group User's Manual: Hardware
 *            (Rev.1.00 R01UH0590EJ0100)
 *
 * Copyright (c) 2024 QEMU Contributors
 *
 * SPDX-License-Identifier: GPL-2.0-or-later
 *
 * This program is free software; you can redistribute it and/or modify it
 * under the terms and conditions of the GNU General Public License,
 * version 2 or later, as published by the Free Software Foundation.
 *
 * This program is distributed in the hope it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License for
 * more details.
 *
 * You should have received a copy of the GNU General Public License along with
 * this program.  If not, see <http://www.gnu.org/licenses/>.
 */

#ifndef HW_RX_RX65N_H
#define HW_RX_RX65N_H

#include "target/rx/cpu.h"
#include "hw/intc/rx_icu.h"
#include "hw/timer/renesas_tmr.h"
#include "hw/timer/renesas_cmt.h"
#include "hw/timer/renesas_mtu3.h"
#include "hw/char/renesas_sci.h"
#include "hw/adc/renesas_s12ad.h"
#include "hw/ssi/renesas_rspi.h"
#include "hw/net/renesas_etherc.h"
#include "hw/misc/rx65n_sysclk.h"
#include "hw/misc/renesas_rx_fcu.h"
#include "hw/misc/renesas_rx_crc.h"
#include "hw/misc/renesas_rx_romcache.h"
#include "hw/gpio/renesas_rx_gpio.h"
#include "hw/dma/renesas_rx_dmac.h"
#include "hw/dma/renesas_rx_dtc.h"
#include "hw/watchdog/renesas_rx_wdt.h"
#include "hw/rtc/renesas_rx_rtc.h"
#include "qom/object.h"

#define TYPE_RX65N_MCU      "rx65n-mcu"
typedef struct RX65NState RX65NState;
DECLARE_INSTANCE_CHECKER(RX65NState, RX65N_MCU, TYPE_RX65N_MCU)

/* Concrete MCU variants */
#define TYPE_R5F565NE_MCU   "r5f565ne-mcu"   /* 512 KB flash, 256 KB RAM */
#define TYPE_R5F565NH_MCU   "r5f565nh-mcu"   /* 2 MB flash,   640 KB RAM */
#define TYPE_R5F5651C_MCU   "r5f5651c-mcu"   /* 1.5 MB flash, 640 KB RAM */

/* External chip-select base (for off-chip SDRAM/SRAM on board) */
#define EXT_CS_BASE         0x01000000
/* Exception vector table resides at the top of internal flash */
#define VECTOR_TABLE_BASE   0xffffff80

/* On-chip memory base addresses (HW manual section 5) */
#define RX65N_IRAM_BASE     0x00000000
/*
 * The primary on-chip SRAM starts at 0x00000000 and is at most 512 KB; the
 * peripheral I/O register space begins right after it at 0x00080000. Devices
 * with more than 512 KB of SRAM (e.g. the 640 KB part) place the remainder in
 * a separate expansion SRAM region at 0x00800000.
 */
/*
 * On-chip SRAM at address 0 is 256 KB on every RX65N/RX651 part. The
 * 640 KB variants carry the remaining 384 KB as expansion RAM at
 * 0x00800000, so the split is fixed rather than a function of the total.
 */
#define RX65N_SRAM_MAX      (256 * 1024)
#define RX65N_EXRAM_BASE    0x00800000
#define RX65N_DFLASH_BASE   0x00100000
/*
 * Code flash base depends on variant flash size; it always ends at
 * 0xFFFFFFFF, so base = 0x100000000 - flash_size.
 *   512 KB variant: 0xFFF80000
 *   2 MB variant:   0xFFE00000
 */
#define RX65N_CFLASH_BASE_512K  0xFFF80000
#define RX65N_CFLASH_BASE_2M    0xFFE00000
#define RX65N_CFLASH_BASE_1M5   0xFFE80000

/* Peripheral base addresses (HW manual section 5) */
#define RX65N_SYSTEM_BASE   0x00080000
#define RX65N_ICU_BASE      0x00087000
#define RX65N_TMR_BASE      0x00088200
#define RX65N_CMT_BASE      0x00088000
/* SCIg/SCIh channels: SCI0 @ 0x8A000, 0x20 spacing (HW manual section 5) */
/* ROM cache control: ROMCE and ROMCIV */
#define RX65N_ROMCACHE_BASE 0x00081000

/* CRC calculator (CRCA) */
#define RX65N_CRC_BASE      0x00088280

#define RX65N_SCI_BASE      0x0008A000
#define RX65N_SCI_SPACING   0x20
#define RX65N_SCI4_BASE     (RX65N_SCI_BASE + 4 * RX65N_SCI_SPACING)
#define RX65N_MTU3_BASE     0x000C1200
#define RX65N_S12AD_BASE    0x00089000
#define RX65N_RSPI0_BASE    0x000D0100
#define RX65N_ETHERC_BASE   0x000C0000
/* Flash Control Unit FACI register block (HW manual section 6) */
/* Option-setting memory (OFSM), holding MDE and BANKSEL */
#define RX65N_OFSM_BASE     0xFE7F5D00

#define RX65N_FCU_BASE      0x007FE000
/* I/O ports (PORTn) and Multi-Function Pin Controller (MPC) */
#define RX65N_GPIO_BASE     0x0008C000
#define RX65N_MPC_BASE      0x0008C100
/* DMA controller and Data Transfer Controller */
#define RX65N_DMAC_BASE     0x00082000
#define RX65N_DTC_BASE      0x00082400
/* Watchdog timers (WDT + IWDT) */
#define RX65N_WDT_BASE      0x00088020
/* Realtime clock */
#define RX65N_RTC_BASE      0x0008C400

/* DMAC channel 0 interrupt vector base (DMAC0I = 120 .. DMAC3I; rest GROUPs) */
#define RX65N_DMAC_IRQ      120

/* Phase 1: minimal peripheral counts (extend in later phases) */
#define RX65N_NR_TMR    2
#define RX65N_NR_CMT    2
/*
 * SCI0 to SCI9 sit in one contiguous block at 0x0008a000. SCI4 is the
 * console; the rest exist so firmware using another channel finds real
 * registers rather than an unmapped hole.
 */
#define RX65N_NR_SCI        10
#define RX65N_SCI_CONSOLE   4

struct RX65NState {
    /*< private >*/
    DeviceState parent_obj;
    /*< public >*/

    RXCPU cpu;
    RXICUState icu;
    RTMRState tmr[RX65N_NR_TMR];
    RCMTState cmt[RX65N_NR_CMT];
    RSCIState sci[RX65N_NR_SCI];
    RXMTU3State mtu3;
    RX65NS12ADState s12ad;
    RX65NRSPIState rspi;
    RX65NEthercState etherc;
    RX65NSysClkState sysclk;
    RenesasRxFcuState fcu;
    RenesasRxCrcState crc;
    RenesasRxRomCacheState romcache;
    RenesasRxGpioState gpio;
    RenesasRxDmacState dmac;
    RenesasRxDtcState dtc;
    RenesasRxWdtState wdt;
    RenesasRxRtcState rtc;

    MemoryRegion *sysmem;
    bool kernel;

    MemoryRegion iram;
    MemoryRegion exram;

    /* Populated during realize; board uses this for firmware loading */
    uint32_t cflash_base;

    /* Input clock (XTAL) frequency */
    uint32_t xtal_freq_hz;
    /* Peripheral module clock frequency (derived from XTAL + PLL) */
    uint32_t pclk_freq_hz;
};

#endif /* HW_RX_RX65N_H */
